Enums/MRS_СтатусыСинхронизацииELMA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_СтатусыСинхронизацииELMA</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТребуетВнимания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/MRS_ИнтеграцияЕЛМАКлиентСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// MRS_ИнтеграцияЕЛМАКлиентСервер: Клиент-серверный модуль интеграции с ЕЛМА
//
// Содержит функции, используемые как на клиенте, так и на сервере:
// - Работа с формами (добавление реквизитов и команд)
// - Форматирование и преобразование данных
// - Валидация
// - Получение представлений статусов и цветов
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

// Вызывается при создании формы документа УстановкаЦенНоменклатуры на сервере
// Добавляет элементы интеграции с ЕЛМА на форму программно
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
//  Отказ - Булево - флаг отказа от создания формы
//  СтандартнаяОбработка - Булево - флаг стандартной обработки
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	Если Форма.ИмяФормы = "Документ.УстановкаЦенНоменклатуры.Форма.ФормаДокумента" Тогда
		
		// Добавление реквизитов формы для хранения данных ЕЛМА
		МассивДобавляемыхРеквизитов = Новый Массив;
		
		МассивДобавляемыхРеквизитов.Добавить(
			Новый РеквизитФормы("СтатусЕЛМА", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150))));
		МассивДобавляемыхРеквизитов.Добавить(
			Новый РеквизитФормы("ДатаОтправкиВЕЛМА", Новый ОписаниеТипов("Дата")));
		МассивДобавляемыхРеквизитов.Добавить(
			Новый РеквизитФормы("УИДЕЛМА", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100))));
		МассивДобавляемыхРеквизитов.Добавить(
			Новый РеквизитФормы("КомментарийЕЛМА", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(500))));
		
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		// Добавление элементов формы для отображения реквизитов
		СтатусЕЛМА = Форма.Элементы.Добавить("СтатусЕЛМА", Тип("ПолеФормы"), Форма.Элементы.ГруппаПодвал);	
		СтатусЕЛМА.Вид = ВидПоляФормы.ПолеВвода;
		СтатусЕЛМА.ПутьКДанным = "СтатусЕЛМА";
		СтатусЕЛМА.ТолькоПросмотр = Истина;
		СтатусЕЛМА.Заголовок = "Статус ЕЛМА";
		
		ДатаОтправкиВЕЛМА = Форма.Элементы.Добавить("ДатаОтправкиВЕЛМА", Тип("ПолеФормы"), Форма.Элементы.ГруппаПодвал);	
		ДатаОтправкиВЕЛМА.Вид = ВидПоляФормы.ПолеВвода;
		ДатаОтправкиВЕЛМА.ПутьКДанным = "ДатаОтправкиВЕЛМА";
		ДатаОтправкиВЕЛМА.ТолькоПросмотр = Истина;
		ДатаОтправкиВЕЛМА.Заголовок = "Дата отправки в ЕЛМА";
		
		УИДЕЛМА = Форма.Элементы.Добавить("УИДЕЛМА", Тип("ПолеФормы"), Форма.Элементы.ГруппаПодвал);	
		УИДЕЛМА.Вид = ВидПоляФормы.ПолеВвода;
		УИДЕЛМА.ПутьКДанным = "УИДЕЛМА";
		УИДЕЛМА.ТолькоПросмотр = Истина;
		УИДЕЛМА.Заголовок = "УИД ЕЛМА";
		
		КомментарийЕЛМА = Форма.Элементы.Добавить("КомментарийЕЛМА", Тип("ПолеФормы"), Форма.Элементы.ГруппаПодвал);	
		КомментарийЕЛМА.Вид = ВидПоляФормы.ПолеВвода;
		КомментарийЕЛМА.ПутьКДанным = "КомментарийЕЛМА";
		КомментарийЕЛМА.ТолькоПросмотр = Истина;
		КомментарийЕЛМА.Заголовок = "Комментарий ЕЛМА";
		
		// Добавление команд формы		
		ДобавитьЭлементыФормы(Форма, "КомандаОтправитьВЕЛМА", "Подключаемый_КомандаОтправитьВЕЛМА", "Отправить в ЕЛМА", 
			"ФормаКоманднаяПанель", "ПодменюОрганайзер", , БиблиотекаКартинок.ВходящееСообщение); 
		ДобавитьЭлементыФормы(Форма, "КомандаОбновитьСтатусЕЛМА", "Подключаемый_КомандаОбновитьСтатусЕЛМА", 
			"Обновить статус ЕЛМА", "ФормаКоманднаяПанель", "ПодменюОрганайзер", , БиблиотекаКартинок.ИсходящееСообщение);
	
		// Загрузка текущего статуса документа из регистра
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
			ЗагрузитьСтатусДокумента(Форма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Загружает статус документа из регистра MRS_ПроцессыЕЛМА и заполняет реквизиты формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
//
Процедура ЗагрузитьСтатусДокумента(Форма) Экспорт
	
	#Если Сервер Тогда
		
		СтруктураСтатуса = MRS_ИнтеграцияЕЛМАСервер.ПолучитьСтатусДокумента(Форма.Объект.Ссылка);
		
		Если СтруктураСтатуса <> Неопределено Тогда
			
			Форма.СтатусЕЛМА = ПолучитьТекстСтатусаЕЛМА(СтруктураСтатуса.Статус);
			Форма.ДатаОтправкиВЕЛМА = СтруктураСтатуса.ДатаОтправки;
			Форма.УИДЕЛМА = СтруктураСтатуса.УИДЕЛМА;
			Форма.КомментарийЕЛМА = СтруктураСтатуса.КомментарийЕЛМА;
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

// Добавляет элементы формы для команды
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма документа
//   ИмяКнопки - Строка - Имя кнопки
//   ИмяКоманды - Строка - Имя команды
//   Заголовок - Строка - Заголовок команды
//   РодительСтр - Строка - Имя родительского элемента
//   ВставитьПеред - Строка - Имя элемента, перед которым вставить
//   ВидКнопки - Строка - Вид кнопки (по умолчанию "ОбычнаяКнопка") 
Процедура ДобавитьЭлементыФормы(Форма, ИмяКнопки, ИмяКоманды, Заголовок, РодительСтр = "", ВставитьПеред = "", ВидКнопки = "ОбычнаяКнопка", Картинка = Неопределено) Экспорт
	
	Родитель = ?(РодительСтр = "", Форма, Форма.Элементы[РодительСтр]);
	нЭлемент = Форма.Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Родитель);
	нЭлемент.Вид = ВидКнопкиФормы[ВидКнопки];
	
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Действие = ИмяКоманды;
	Команда.Заголовок = Заголовок;
 
	нЭлемент.ИмяКоманды = ИмяКоманды;
	Если ВставитьПеред <> "" Тогда
		Форма.Элементы.Переместить(нЭлемент, Родитель, Форма.Элементы[ВставитьПеред]); 
	КонецЕсли; 
	
	Если Картинка <> Неопределено Тогда 
		нЭлемент.Картинка = Картинка;
	    нЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
	    нЭлемент.ПоложениеКартинки = ПоложениеКартинкиКнопкиФормы.Лево;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПреобразованиеДанных

// Получает текстовое представление статуса ЕЛМА для отображения пользователю
//
// Параметры:
//  СтатусЕЛМА - ПеречислениеСсылка.MRS_СтатусыСинхронизацииELMA или Строка
//
// Возвращаемое значение:
//  Строка - текстовое представление статуса
//
Функция ПолучитьТекстСтатусаЕЛМА(СтатусЕЛМА) Экспорт
	
	Если ТипЗнч(СтатусЕЛМА) = Тип("Строка") Тогда
		Возврат СтатусЕЛМА;
	КонецЕсли;
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		Если СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.ВОчереди Тогда
			Возврат "В очереди на отправку";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.НаСогласовании Тогда
			Возврат "На согласовании";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Согласован Тогда
			Возврат "Согласован";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Подписан Тогда
			Возврат "Подписан";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Отклонен Тогда
			Возврат "Отклонен";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Отменен Тогда
			Возврат "Отменен";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Ошибка Тогда
			Возврат "Ошибка отправки";
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.ТребуетВнимания Тогда
			Возврат "Требует внимания";
			
		Иначе
			Возврат "Не определен";
			
		КонецЕсли;
		
	#Иначе
		
		// На клиенте используем строковое представление
		Возврат Строка(СтатусЕЛМА);
		
	#КонецЕсли
	
КонецФункции

// Получает цвет для отображения статуса ЕЛМА
//
// Параметры:
//  СтатусЕЛМА - ПеречислениеСсылка.MRS_СтатусыСинхронизацииELMA
//
// Возвращаемое значение:
//  Цвет - цвет для оформления статуса
//
Функция ПолучитьЦветСтатусаЕЛМА(СтатусЕЛМА) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		Если СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.ВОчереди Тогда
			Возврат ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС; // Серый
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.НаСогласовании Тогда
			Возврат ЦветаСтиля.ЦветГиперссылкиГосИС; // Синий
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Согласован Тогда
			Возврат ЦветаСтиля.ЦветГиперссылкиГосИС; // Синий
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Подписан Тогда
			Возврат ЦветаСтиля.ЦветТекстаУспехГосИС; // Зеленый
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Отклонен Тогда
			Возврат ЦветаСтиля.ЦветОтрицательногоЧислаГосИС; // Красный
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Отменен Тогда
			Возврат ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС; // Серый
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Ошибка Тогда
			Возврат ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС; // Желтый
			
		ИначеЕсли СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.ТребуетВнимания Тогда
			Возврат ЦветаСтиля.ЦветОтрицательногоЧислаГосИС; // Красный
			
		Иначе
			Возврат Новый Цвет; // Цвет по умолчанию
			
		КонецЕсли;
		
	#Иначе
		
		// На клиенте возвращаем цвет по умолчанию
		Возврат Новый Цвет;
		
	#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область Валидация

// Валидирует документ перед отправкой в ЕЛМА (клиент-серверная проверка)
//
// Параметры:
//  Документ - ДокументОбъект.УстановкаЦенНоменклатуры или СтруктураДанных
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * МассивОшибок - Массив из Строка - список ошибок валидации
//
// Валидирует документ и параметры приказа перед отправкой в ЕЛМА
//
// Параметры:
//  Документ - ДокументОбъект.УстановкаЦенНоменклатуры - документ для отправки
//  ПараметрыПриказа - Структура - параметры из формы MRS_ФормаПараметровПриказаЕЛМА:
//   * ОтветственныйЗаИсполнение - СправочникСсылка.ФизическиеЛица
//   * СписокКОзнакомлению - ТаблицаЗначений с колонкой ФизическоеЛицо
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево - Истина если валидация прошла успешно
//   * МассивОшибок - Массив из Строка - список ошибок валидации
//
Функция ВалидироватьДокументПередОтправкой(Документ, ПараметрыПриказа = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("МассивОшибок", Новый Массив);
	
	// === Проверка документа ===
	
	// Проверка заполнения даты начала действия
	Если НЕ ЗначениеЗаполнено(ПараметрыПриказа.ДатаНачалаДействия) Тогда
		Результат.МассивОшибок.Добавить("Не заполнена дата начала действия цен");
	КонецЕсли;
	
	// Проверка наличия строк с ценами
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		Если Документ.Товары.Количество() = 0 Тогда
			Результат.МассивОшибок.Добавить("В документе отсутствуют строки с ценами");
		КонецЕсли;
		
	#КонецЕсли
	
	// Проверка даты в будущем
	Если ЗначениеЗаполнено(ПараметрыПриказа.ДатаНачалаДействия) Тогда
		
		Если ПараметрыПриказа.ДатаНачалаДействия < НачалоДня(ТекущаяДата()) Тогда
			Результат.МассивОшибок.Добавить("Дата начала действия не может быть в прошлом");
		КонецЕсли;
		
	КонецЕсли;
	
	// === Проверка параметров приказа (если переданы) ===
	
	Если ПараметрыПриказа <> Неопределено Тогда
		
		// Проверка заполнения ответственного за исполнение
		Если НЕ ПараметрыПриказа.Свойство("ОтветственныйЗаИсполнение") 
			ИЛИ НЕ ЗначениеЗаполнено(ПараметрыПриказа.ОтветственныйЗаИсполнение) Тогда
			
			Результат.МассивОшибок.Добавить("Не заполнен ответственный за исполнение приказа");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.Успех = (Результат.МассивОшибок.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Форматирование

// Форматирует дату для отображения в интерфейсе
//
// Параметры:
//  Дата - Дата - дата для форматирования
//  СПодробностями - Булево - включать ли время
//
// Возвращаемое значение:
//  Строка - отформатированная дата
//
Функция ФорматироватьДату(Дата, СПодробностями = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СПодробностями Тогда
		Возврат Формат(Дата, "ДФ='dd.MM.yyyy HH:mm:ss'");
	Иначе
		Возврат Формат(Дата, "ДФ='dd.MM.yyyy'");
	КонецЕсли;
	
КонецФункции

// Формирует описание статуса для подсказки пользователю
//
// Параметры:
//  СтатусЕЛМА - ПеречислениеСсылка.MRS_СтатусыСинхронизацииELMA
//  ДатаОтправки - Дата
//  Комментарий - Строка
//
// Возвращаемое значение:
//  Строка - полное описание статуса
//
Функция ПолучитьОписаниеСтатуса(СтатусЕЛМА, ДатаОтправки = Неопределено, Комментарий = "") Экспорт
	
	Описание = ПолучитьТекстСтатусаЕЛМА(СтатусЕЛМА);
	
	Если ЗначениеЗаполнено(ДатаОтправки) Тогда
		Описание = Описание + Символы.ПС + "Дата отправки: " + ФорматироватьДату(ДатаОтправки, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		Описание = Описание + Символы.ПС + "Комментарий: " + Комментарий;
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет доступность функциональности интеграции с ЕЛМА
//
// Возвращаемое значение:
//  Булево - Истина если интеграция доступна
//
Функция ИнтеграцияЕЛМАДоступна() Экспорт
	
	// TODO: Реализовать проверку настроек и прав доступа
	// Пока всегда возвращаем Истина
	
	Возврат Истина;
	
КонецФункции

// Получает признак необходимости автоматического обновления статуса
//
// Параметры:
//  СтатусЕЛМА - ПеречислениеСсылка.MRS_СтатусыСинхронизацииELMA
//
// Возвращаемое значение:
//  Булево - Истина если нужно обновлять статус автоматически
//
Функция ТребуетсяАвтообновлениеСтатуса(СтатусЕЛМА) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		// Автообновление нужно для промежуточных статусов
		Если СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.ВОчереди
			Или СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.НаСогласовании
			Или СтатусЕЛМА = Перечисления.MRS_СтатусыСинхронизацииELMA.Согласован Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти
